; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	)
(:init
	(at plane1 city4)
	(= (capacity plane1) 11877)
	(= (fuel plane1) 3320)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 14)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 6)
	(at plane2 city0)
	(= (capacity plane2) 11609)
	(= (fuel plane2) 296)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 13)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 6)
	(at person1 city4)
	(at person2 city4)
	(at person3 city1)
	(at person4 city5)
	(at person5 city1)
	(at person6 city3)
	(at person7 city0)
	(at person8 city3)
	(at person9 city4)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 771)
	(= (distance city0 city2) 751)
	(= (distance city0 city3) 982)
	(= (distance city0 city4) 933)
	(= (distance city0 city5) 891)
	(= (distance city0 city6) 771)
	(= (distance city1 city0) 771)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 660)
	(= (distance city1 city3) 563)
	(= (distance city1 city4) 633)
	(= (distance city1 city5) 597)
	(= (distance city1 city6) 747)
	(= (distance city2 city0) 751)
	(= (distance city2 city1) 660)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 554)
	(= (distance city2 city4) 600)
	(= (distance city2 city5) 549)
	(= (distance city2 city6) 520)
	(= (distance city3 city0) 982)
	(= (distance city3 city1) 563)
	(= (distance city3 city2) 554)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 526)
	(= (distance city3 city5) 622)
	(= (distance city3 city6) 876)
	(= (distance city4 city0) 933)
	(= (distance city4 city1) 633)
	(= (distance city4 city2) 600)
	(= (distance city4 city3) 526)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 754)
	(= (distance city4 city6) 790)
	(= (distance city5 city0) 891)
	(= (distance city5 city1) 597)
	(= (distance city5 city2) 549)
	(= (distance city5 city3) 622)
	(= (distance city5 city4) 754)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 912)
	(= (distance city6 city0) 771)
	(= (distance city6 city1) 747)
	(= (distance city6 city2) 520)
	(= (distance city6 city3) 876)
	(= (distance city6 city4) 790)
	(= (distance city6 city5) 912)
	(= (distance city6 city6) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city4)
	(at person2 city5)
	(at person3 city3)
	(at person4 city6)
	(at person5 city4)
	(at person6 city0)
	(at person7 city1)
	(at person8 city0)
	(at person9 city1)
	))

(:metric minimize (+ (* 4 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (refuel plane1 city4)
   changed: (fuel plane1) from 3320 to 11877
   goals met: 1 of 9
2. (board person2 plane1 city4)
   deleted: (at person2 city4)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 9
3. (board person9 plane1 city4)
   deleted: (at person9 city4)
   added: (in person9 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 1 of 9
4. (fly plane1 city4 city3)
   deleted: (at plane1 city4)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 0 to 2630, (fuel plane1) from 11877 to 9247
   goals met: 1 of 9
5. (board person6 plane1 city3)
   deleted: (at person6 city3)
   added: (in person6 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 1 of 9
6. (board person8 plane1 city3)
   deleted: (at person8 city3)
   added: (in person8 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 1 of 9
7. (fly plane1 city3 city5)
   deleted: (at plane1 city3)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 2630 to 5740, (fuel plane1) from 9247 to 6137
   goals met: 1 of 9
8. (debark person2 plane1 city5)
   deleted: (in person2 plane1)
   added: (at person2 city5)
   changed: (onboard plane1) from 4 to 3
   goals met: 2 of 9
9. (board person4 plane1 city5)
   deleted: (at person4 city5)
   added: (in person4 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 2 of 9
10. (fly plane1 city5 city6)
   deleted: (at plane1 city5)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 5740 to 10300, (fuel plane1) from 6137 to 1577
   goals met: 2 of 9
11. (refuel plane1 city6)
   changed: (fuel plane1) from 1577 to 11877
   goals met: 2 of 9
12. (debark person4 plane1 city6)
   deleted: (in person4 plane1)
   added: (at person4 city6)
   changed: (onboard plane1) from 4 to 3
   goals met: 3 of 9
13. (fly plane1 city6 city0)
   deleted: (at plane1 city6)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 10300 to 14155, (fuel plane1) from 11877 to 8022
   goals met: 3 of 9
14. (debark person6 plane1 city0)
   deleted: (in person6 plane1)
   added: (at person6 city0)
   changed: (onboard plane1) from 3 to 2
   goals met: 4 of 9
15. (debark person8 plane1 city0)
   deleted: (in person8 plane1)
   added: (at person8 city0)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 9
16. (board person7 plane1 city0)
   deleted: (at person7 city0)
   added: (in person7 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 5 of 9
17. (fly plane1 city0 city1)
   deleted: (at plane1 city0)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 14155 to 18010, (fuel plane1) from 8022 to 4167
   goals met: 5 of 9
18. (debark person7 plane1 city1)
   deleted: (in person7 plane1)
   added: (at person7 city1)
   changed: (onboard plane1) from 2 to 1
   goals met: 6 of 9
19. (debark person9 plane1 city1)
   deleted: (in person9 plane1)
   added: (at person9 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 7 of 9
20. (board person3 plane1 city1)
   deleted: (at person3 city1)
   added: (in person3 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 7 of 9
21. (board person5 plane1 city1)
   deleted: (at person5 city1)
   added: (in person5 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 7 of 9
22. (fly plane1 city1 city3)
   deleted: (at plane1 city1)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 18010 to 20825, (fuel plane1) from 4167 to 1352
   goals met: 7 of 9
23. (debark person3 plane1 city3)
   deleted: (in person3 plane1)
   added: (at person3 city3)
   changed: (onboard plane1) from 2 to 1
   goals met: 8 of 9
24. (refuel plane1 city3)
   changed: (fuel plane1) from 1352 to 11877
   goals met: 8 of 9
25. (fly plane1 city3 city4)
   deleted: (at plane1 city3)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 20825 to 23455, (fuel plane1) from 11877 to 9247
   goals met: 8 of 9
26. (debark person5 plane1 city4)
   deleted: (in person5 plane1)
   added: (at person5 city4)
   changed: (onboard plane1) from 1 to 0
   goals met: 9 of 9
